_posts/2011-10-12-db-class.html
---
layout: post
title: Personal notes for the stanford db-class
tags: ai, stanford, lecture notes
---

<p>
I am following the Stanford <a href="http://www.db-class.com">db-class</a> online, and using this post for
keeping track of progress/notes/links etc. These notes are very rough,
mostly a personal log of progress&hellip;
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Lecture Notes </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Lecture 1 - Intro to databases </h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Massive data; Persistent; Safe; Multi-user; Convenient; Convenient
      (Physical data layout independence; SQL - declarative); Efficient; Reliable
</li>
</ul>




<ul>
<li>Data Model - set of records; XML; graph 
    Schema vs Data ( types/ variables)
    DDL - Data Definition Language - set up schema
    DML - Data manipulation (querying / modification)
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Lecture 2: Relational Model </h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Be careful of Null values! GPA &gt; 3.5 or GPA &lt;= 3.5 ( doesn't return null values)
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Lecture 2 : Query Relational Databases </h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>Relational Algebra - formal (theory) ; SQL (actual/ implementation)
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">XML Data </h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>Tree hierarchy; XSLT (XML -&gt; HTML) ; 
</li>
<li>DTD
</li>
<li>XSD - Like DTD, data types, typed pointers, checked
     types(e.g. integers) etc.
<ul>
<li>XSD written in XML 
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Homework Notes </h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Web Links </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="http://www.reddit.com/r/dbclass">Reddit Discussions</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Other </h2>
<div class="outline-text-2" id="text-4">


</div>
</div>
